"""
字符串的简单使用
Version:1.0
Author:x鑫
"""
# 字符串定义：由零个或多个字符组成的有限序列
# 表达方式：用单个引号或双引号包围起来
s1 = 'hello world'
s2 = "你好兄弟！"
s3 = ''' hello,
wonderful
world!
'''
print(s1)
print(s2)
print(s3)
# 分割线
print("--------------------------------------------")

# 转义字符说明及对应符号： 在字符串中可以用\（反斜杠）来表示，代表着\后面的字符不再是它原来的意义
# 例如：\n是换行，\t是制表符;又如字符串本身的'、"、\这些特殊的字符，必须通过\进行转义处理
s1 = '\'hello world\''
s2 = '\\hello world\\'
print(s1)
print(s2)
# 分割线
print("--------------------------------------------")

# 原始字符串说明：以r或R开头的字符串，被称为原始字符串--意思是字符串中的每个字符都是它本身的含义，没有所谓的转义字符
# 例如：在字符串"hello\n"中，\n表示换行;而在r'hello\n'中，\n不在表示换行，只是字符\和n
s1 = '\it \is \time \to \read \now' # \r是回车符
s2 = r'\it \is \time \to \read \now'
print(s1)
print(s2)
